app/controllers/articles_controller.rb

SELECT `users`.* FROM `users` ORDER BY `users`.`id` ASC LIMIT 1
INSERT INTO `articles` (`title`, `description`, `created_at`, `updated_at`, `user_id`) VALUES ('QRERf', 'asrfaewtfg', '2024-07-30 14:53:21.616084', '2024-07-30 14:53:21.616084', 2)
---
  def create
    @article = Article.new(article_params)
    @article.user = User.first
    if @article.save

UPDATE `articles` SET `articles`.`title` = '1st article', `articles`.`updated_at` = '2024-07-30 14:56:55.823264' WHERE `articles`.`id` = 3
---
  def update
    if @article.update(article_params)